# Importing the libraries

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import openpyxl
# import xlrd

# Creating the dataset

In [2]:
data = {
    "ID" : [1,2,3,4,5],
    "Name" : ['Apple','Mango','Banana','Gauva','Orange'],
    "Color" : ['Red','Yellow', 'Yellow', 'Green', 'Orange'],
    "Price" : [110,100,40,50,80]
}

In [3]:
fruit_data = pd.DataFrame(data)

In [4]:
fruit_data

   ID    Name   Color  Price
0   1   Apple     Red    110
1   2   Mango  Yellow    100
2   3  Banana  Yellow     40
3   4   Gauva   Green     50
4   5  Orange  Orange     80

# DataFrame to different file format

In [5]:
fruit_data.to_csv("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data_csv.csv", index=False)

In [6]:
data_excel = fruit_data.to_excel("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data_excel.xlsx", index=False)

In [7]:
data_json = fruit_data.to_json("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data.json")

In [8]:
engine = create_engine('sqlite://',echo=False)

In [9]:
fruit_data.to_sql('my_table',con=engine)

5

# Loading the data

In [10]:
data1 = pd.read_csv("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data_csv.csv")

In [11]:
data1

   ID    Name   Color  Price
0   1   Apple     Red    110
1   2   Mango  Yellow    100
2   3  Banana  Yellow     40
3   4   Gauva   Green     50
4   5  Orange  Orange     80

In [12]:
data2 = pd.read_excel("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data_excel.xlsx")

In [13]:
data2

   ID    Name   Color  Price
0   1   Apple     Red    110
1   2   Mango  Yellow    100
2   3  Banana  Yellow     40
3   4   Gauva   Green     50
4   5  Orange  Orange     80

In [14]:
data3 = pd.read_json("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\data.json")

In [15]:
data3

   ID    Name   Color  Price
0   1   Apple     Red    110
1   2   Mango  Yellow    100
2   3  Banana  Yellow     40
3   4   Gauva   Green     50
4   5  Orange  Orange     80

In [16]:
data4 = pd.read_sql("SELECT * FROM my_table", engine)

In [17]:
data4

   index  ID    Name   Color  Price
0      0   1   Apple     Red    110
1      1   2   Mango  Yellow    100
2      2   3  Banana  Yellow     40
3      3   4   Gauva   Green     50
4      4   5  Orange  Orange     80

In [18]:
def display_summary_statistic(data):
    print("Data:- \n", data.head())
    print("\nDescribe:- \n",data.describe())
    print("\nType:- \n", type(data))
    print("\nCorrelation:- \n", data.corr())
    print("\nSum of missing data point:- \n", data.isnull().sum())

In [19]:
display_summary_statistic(data4)

Data:-
    index  ID    Name   Color  Price
0      0   1   Apple     Red    110
1      1   2   Mango  Yellow    100
2      2   3  Banana  Yellow     40
3      3   4   Gauva   Green     50
4      4   5  Orange  Orange     80

Describe:-
           index        ID       Price
count  5.000000  5.000000    5.000000
mean   2.000000  3.000000   76.000000
std    1.581139  1.581139   30.495901
min    0.000000  1.000000   40.000000
25%    1.000000  2.000000   50.000000
50%    2.000000  3.000000   80.000000
75%    3.000000  4.000000  100.000000
max    4.000000  5.000000  110.000000

Type:-
 <class 'pandas.core.frame.DataFrame'>

Correlation:-
           index        ID     Price
index  1.000000  1.000000 -0.570323
ID     1.000000  1.000000 -0.570323
Price -0.570323 -0.570323  1.000000

Sum of missing data point:-
 index    0
ID       0
Name     0
Color    0
Price    0
dtype: int64

C:\Users\raths\AppData\Local\Temp\ipykernel_23036\3233973822.py:5: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  print("\nCorrelation:- \n", data.corr())